/**
 * TASK-02
 *
 * Напишіть програму для підрахунку знищених цілей.
 *
 * User-flow:
 *  - програма має запитати користувача, чи хоче він увести кількість знищених цілей
 *  - якщо "так" - дати користувачу мождливість увести число
 *  - знову запитати чи хоче користуваач увести кількість знищених цілей
 *
 * І так по колу, поки користуваач не відмовиться від вводу.
 * Як тільки користуач відмовився - показали загальну сумму усіх цілей,
 * скільки користувач вводив до цього, якщо вона більша ніж 0.
 */

function getNumberFromUser(msg) {
  let number = prompt(msg, 999);

  while (isNaN(+number) || number === null) {
    alert("Якась фігня...ви точно число вводили?");
    number = prompt("Введіть будьласка число, а не якусь ахінєю!");
  }

  return number;
}

function countTargets() {
  let targetDestroyed = 0;

  while (confirm("Чи не бажає пан увести кількість уражених цілей?")) {
    let number = getNumberFromUser("Скільки цілей було ураджено?");

    targetDestroyed += Number(number);
  }

  if (targetDestroyed > 0) {
    alert("Кількість уражених цілей - " + targetDestroyed);
  }
}

countTargets();
