/**
 * TASK - склад гуманіитарної допомоги
 *
 * Напишіть функцію, що повертає обʼєкт складу.
 *
 * Властивості складу:
 * - store - масив обʼєктів, кожен з яких це окремий товар з назвою та кількістю одиниць
 * - employees - масив з іменами працівників
 *
 * Методи:
 * - addItem - додати одиницю товару. Після виклику запитує у користвача окремими промптами спочатку назву, потім кількість товару.
 * - removeItem - додати одиницю товару. Після виклику запитує у користвача окремими промптами спочатку назву, потім кількість товару що треба видалити.
 * - checkItem - перевіряє чи є товар з вказаним іменем на складі взагалі.
 * - getAmount - повертає кількість вказаного товару на складі
 * - getMoreThen - повертає масив товарів, у яких кількість більша за зазначену
 */