/**
 * TASK-02
 *
 * Написати свою невеличку реалізацію чату за допомогою функцій, обʼєктів та простого використання масивів.
 *
 * Обʼєкт чату повинен мати:
 * - двох адресатів, що представлені типовими обʼєктами користувачів
 * - історію повідомлень, що представлені типовими обʼєктами повідомлень
 * - можливість додати в історію нове повідомлення.
 * - можливість очистити історію.
 *
 * Обʼєкт користувача повинен мати:
 * - нікнейм
 * - метод для створення чату з іншим користувачем
 * - метод для відправки повідомлення
 *
 * Обʼєкт повідомлення повинен мати:
 * - текст
 * - відправник
 * - отримувач
 */
