/**
 * TASK-01
 *
 * Створити екран адмін-панелі з відображенням користувачів у системі.
 *
 * У першу чергу користувач має бачити на екрані лише один інпут, де має ввести своє імʼя.
 *
 * Якщо користувач з таким імʼям у системі інсує - відрендерити на сторінці список усіх користувачів.
 * Якщо такого користувача нема - показати повідомлення про помилку під полем для вводу.
 *
 * на екрані відображаються картки користувачів у системі. Кожен користувач має:
 * - ім'я
 * - роль
 *
 * Якщо у користувача, під імʼям якого увійшли в систему є роль admin:
 * - відображати кнопку для видалення користувача на кожній картці
 * - відображати ролі усіх користувачів як поля для вводу даних, щоб мати можливість змінити роль будь якого користувача
 *
 * У якості API використовувати сервер - https://github.com/BUI-studies/simple-server
 * Для його запуску:
 * - клонувати репозиторій
 * - у теці репозиторію виконати команду npm install
 * - запустити команду npm dev або npm start
 */
